Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--geostyler_quickstart.tmx
Source language: en
Languages: ja

source: GeoStyler Quickstart
ja: GeoStyler クイックスタート

source: This Quickstart describes some basic steps required to start working with GeoStyler: installing GeoStyler and adding a first UI component to your react application.
ja: このクイックスタートでは、GeoStylerをはじめて使うときの基本的な手順について説明します。GeoStylerをインストールし、最初のUIコンポーネントをreactアプリケーションに追加します。

source: A complete beginner tutorial can be found on `localhost/geostyler <localhost/geostyler>`__.
ja: 完全な初心者向けチュートリアルは、`localhost/geostyler<localhost/geostyler>`__にあります。

source: GeoStyler makes it easy to style geodata in any web page. The UI is independent from any styling format and should be usable for e.g. OpenLayer or SLD.
ja: GeoStylerを使用すると、あらゆるWebページで地理データのスタイルを簡単に設定できます。UIはどのスタイルフォーマットからも独立しており、OpenLayerやSLDなどで使用できます。

source: (Optional) Installing GeoStyler
ja: (オプション)GeoStylerのインストール

source: OSGeoLive comes with GeoStyler already installed. So you should be able to import it into your project as described in the next section. You can skip this section, if you just want to take a first look at the library.
ja: OSGeoLiveにはGeoStylerがすでにインストールされています。したがって、次のセクションで説明するように、プロジェクトにインポートできるはずです。ライブラリを最初に見たい場合は、このセクションをスキップできます。

source: However, it is recommended to install GeoStyler for each project separately. This sections describes the required steps.
ja: ただし、GeoStylerはプロジェクトごとに個別にインストールすることをお勧めします。ここでは、必要な手順について説明します。

source: The most simple way to install GeoStyler is to use ``npm``. Simply run following command from your project root:
ja: GeoStylerをインストールする最も簡単な方法は、``npm``を使用することです。プロジェクトのルートから次のコマンドを実行するだけです。

source: Please make sure that all peer dependencies are installed in the specified versions:
ja: 関連する依存ライブラリのインストールについて指定されたバージョンであるか、確認してください:

source: Don't forget to install the parsers you want to use:
ja: 使用するパーサーのインストールを忘れないでください:

source: Integrate GeoStyler
ja: GeoStylerを統合

source: Import the GeoStyler ``Style`` component into your application as follows:
ja: GeoStyler``Style``コンポーネントを次のようにアプリケーションにインポートします:

source: The ``Style`` component provides a variety of styling functionality.
ja: ``Style``コンポーネントは、さまざまなスタイリング機能を提供します。

source: After importing, you can use it in your render method like this:
ja: インポート後、レンダリングメソッドで次のように使用できます。

source: The ``Style`` component should now be visible in the browser.
ja: ``Style``コンポーネントがブラウザに表示されます。

source: Integrate geostyler-sld-parser
ja: geostyler-sld-parserを統合

source: To edit an existing SLD via GeoStyler, we first have to import and instantiate the ``geostyler-sld-parser``.
ja: GeoStylerを使用して既存のSLDを編集するには、まず``geostyler-sld-parser``をインポートしてインスタンス化する必要があります。

source: Afterwards, we are able to read an existing SLD into the GeoStyler-readable format.
ja: その後、既存のSLDをGeoStylerで読み取り可能な形式で読み込むことができます。

source: To connect this style with the UI, we have to store it in a state variable and pass it to our ``Style`` component. After defining ``myStyle`` as a state variable, you can use it as follows:
ja: このスタイルをUIに接続するには、状態変数に保存し、``Style``コンポーネントに渡す必要があります。``myStyle``を状態変数として定義すると、次のように使用できます。

source: The GeoStyler UI should now match the style that was defined as SLD.
ja: GeoStyler UIは、SLDとして定義されたスタイルと一致します。

source: To get the edited style as SLD from the ``Style`` component, you can use the ``writeStyle()`` method of the geostyler-sld-parser within the ``onStyleChange()`` method of the ``Style`` component.
ja: 編集されたスタイルを``Style``コンポーネントからSLDとして取得するには、``Style``コンポーネントの``onStyleChange()``メソッド内でgeostyler-sld-parserの``writeStyle()``メソッドを使用できます。

source: Things to try
ja: 試してみること

source: As a next step, you can try to add an OpenLayers map and connect the ``Style`` component to the map, so that you can directly see the changes you made on the map.
ja: 次のステップとして、OpenLayersマップを追加し、``Style``コンポーネントをマップに接続して、マップ上で行った変更を直接見ることができます。

source: What next?
ja: 次のステップ

source: Check out these other resources about this application.
ja: このアプリケーションに関する他のリソースを確認してください。

source: `GeoStyler Documentation <https://geostyler.github.io/geostyler/latest/index.html>`__
ja: `GeoStyler 文書 <https://geostyler.github.io/geostyler/latest/index.html>`__

source: `Beginner Tutorial <https://geostyler.github.io/geostyler-beginner-workshop>`__
ja: `初心者むけチュートリアル <https://geostyler.github.io/geostyler-beginner-workshop>`__

source: `geostyler.org Website <https://geostyler.org>`__
ja: `geostyler.org Webサイト <https://geostyler.org>`__
